fn main() {
    // 初期化
    let mut a = 5;
    let mut b = 42;
    println!("交換前の値, (a, b) = ({}, {})", a, b);

    // シンプルな値の交換
    let temp = a;
    a = b;
    b = temp;
    println!("シンプルな値の交換後の値, (a, b) = ({}, {})", a, b);

    // ビットごとの排他的論理和による値の交換
    b ^= a;
    a ^= b;
    b ^= a;
    println!(
        "ビットごとの排他的論理和による値の交換後の値, (a, b) = ({}, {})",
        a, b
    );

    // 符号あり数値型の和と差を用いた値の交換
    b = a - b;
    a -= b;
    b += a;
    println!(
        "符号あり数値型の和と差を用いた値の交換後の値, (a, b) = ({}, {})",
        a, b
    );

    // 標準ライブラリを用いた値の交換
    std::mem::swap(&mut a, &mut b);
    println!(
        "標準ライブラリを用いた値の交換後の値, (a, b) = ({}, {})",
        a, b
    );
}
